<a href="https://colab.research.google.com/github/KenyanGeek/Retail-Data-Science-and-Machine-Learning/blob/master/HURU_School_Introduction_to_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **SQLITE3**

In [ ]:
!pip install db-sqlite3

Requirement already satisfied: db-sqlite3 in /usr/local/lib/python3.6/dist-packages (0.0.1)
Requirement already satisfied: db in /usr/local/lib/python3.6/dist-packages (from db-sqlite3) (0.1.1)
Requirement already satisfied: antiorm in /usr/local/lib/python3.6/dist-packages (from db->db-sqlite3) (1.2.1)

In [ ]:
import sqlite3
import pandas as pd
from datetime import date

In [ ]:
#connect with db
db =sqlite3.connect("test.db")
db.execute("drop table if exists results")
try:
  db.execute("create table results (Name text, Date datetime,Phone text, Email text)")
except:
  print("table already exist")

In [ ]:
db =sqlite3.connect("test.db")

In [ ]:
Name ="useless"
Date =date.today().strftime("%d-%m-%Y")
Phone ="+254729282"
Email ="llll@gmail.com"

In [ ]:
cmd = "insert into results(Name, Phone,Date,Email) values('{}','{}','{}','{}')".format(Name,Phone,Date,Email)
db.execute(cmd)
db.commit()

**Querying**

In [ ]:
db = sqlite3.connect("test.db")
rs = db.execute('SELECT * FROM results')
for row in rs:
    print (row)

('useless', '05-02-2021', '+254729282', 'llll@gmail.com')

In [ ]:
db = sqlite3.connect("test.db")
rs = db.execute('SELECT * FROM results')
for row in rs:
    print (row)

('useless', '05-02-2021', '+254729282', 'llll@gmail.com')

In [ ]:
db = sqlite3.connect("test.db")
qry = """

SELECT * FROM results 

"""
df = pd.read_sql_query(qry, db)
df.head()

      Name        Date       Phone           Email
0  useless  05-02-2021  +254729282  llll@gmail.com

**Intro to Pnadas**

- The pandas library a central component of the data science toolkit. 
- It is used in conjunction with other libraries in that collection.

- It is built on top of the NumPy package, meaning a lot of the structure of NumPy is used or replicated in Pandas. 

- Data in pandas is often used to feed statistical analysis in SciPy, plotting functions from Matplotlib, and machine learning algorithms in Scikit-learn.

**What can I do with it?**

-All the queries that you were putting to the data before in SQL in the previous class, and so many more things!

-Pandas is almost similar to Excel. You will be comfortable working with structured data in Pandas when using Python



-Lets Get to it!

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_csv('/content/sample_data/california_housing_train.csv', sep=',',)
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

### Pandas have 2 major data structures/ containers/data types, 

`Series` and

 `DataFrame`

---

In [ ]:
type(df), type(df['longitude'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

A series is similar in stuctured to a 1-array but with extra information like index, header etc.

In [ ]:
df['longitude']

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [ ]:
df['longitude'].values # or use df['longitude'].to_numpy()

array([-114.31, -114.47, -114.56, ..., -124.3 , -124.3 , -124.35])

Creating a Series by passing a list of values, letting pandas create a default integer index or include an index. 

You can  also create a pandas series from a python list, numpy array or dictionary

In [ ]:
labels1 = ['a','b','c']
list1 = [10, 200, 300]
arr1 = np.array([110,270,30])
dict1 = {'a' : 10,'b' : 20,'c' : 30}

In [ ]:
data1 =pd.Series(data=labels1)
data1

0    a
1    b
2    c
dtype: object

In [ ]:
pd.Series(data=list1, index=labels1)

a     10
b    200
c    300
dtype: int64

**Operations on Series**
)

In [ ]:

ser1 = pd.Series([1,2,3,4], index = ['Kenya', 'Uganda','USSR', 'Japan']) 
ser2 = pd.Series([1,2,5,4], index = ['Kenya', 'Japan','Italy', 'Uganda'])

In [ ]:
ser1 + ser2

Italy     NaN
Japan     6.0
Kenya     2.0
USSR      NaN
Uganda    6.0
dtype: float64

Data Frame

In [ ]:
from numpy.random import randn
np.random.seed(101)

In [ ]:
df2 = pd.DataFrame(randn(6,5),
                   index=list('ABCDEF'),
                   columns='U V W X Y'.split()
                   )

In [ ]:
df2

          U         V         W         X         Y
A -0.251897 -0.578120  0.236996  0.200780  0.327845
B  0.674485 -0.174057  0.780140 -0.383258 -0.409318
C  0.343539  0.196275 -0.982776  2.231555 -0.971393
D -1.522333  1.133703  0.528187  0.393461 -0.630507
E -1.398290 -0.219311 -0.045676  0.012421  0.093628
F  1.240813 -1.097693 -1.908009 -0.380104 -1.666059

In [ ]:
df3 = pd.DataFrame(
            {
            "A": 1.0,
            "B": pd.Timestamp("20130102"),
            "C": pd.Series(1, index=list(range(4)), dtype="float32"),
            "D": np.array([3]*4, dtype="int32"),
            "E": pd.Categorical(["test", "train", "test", "train"]),
            "F": "foo",
            }
          )

In [ ]:
df3

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Quiz1
Create a pandas dataframe with the following datatypes as columns:


float32

int

object

float64

# SLICING AND INDEXING

In [ ]:
obj1 = df3['A']

obj2 = df3[['A']]
obj3 =df3[['B', 'C']]#multiple columns

In [ ]:
df4 = df[0:200].copy()

Reme Columns

In [ ]:
df4.drop('population', axis=1)

     longitude  latitude  ...  median_income  median_house_value
0      -114.31     34.19  ...         1.4936             66900.0
1      -114.47     34.40  ...         1.8200             80100.0
2      -114.56     33.69  ...         1.6509             85700.0
3      -114.57     33.64  ...         3.1917             73400.0
4      -114.57     33.57  ...         1.9250             65500.0
..         ...       ...  ...            ...                 ...
195    -116.38     34.20  ...         2.0674             65000.0
196    -116.38     34.10  ...         4.1458            116300.0
197    -116.38     33.74  ...         4.0840            194500.0
198    -116.38     33.73  ...         4.0079            134500.0
199    -116.38     33.71  ...         4.5556            258100.0

[200 rows x 8 columns]

Selecting rows

In [ ]:
df.iloc[[3, 4]]

   longitude  latitude  ...  median_income  median_house_value
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[2 rows x 9 columns]

In [ ]:
df.loc[[3]]

   longitude  latitude  ...  median_income  median_house_value
3    -114.57     33.64  ...         3.1917             73400.0

[1 rows x 9 columns]

# Conditional Selection

In [ ]:
df2[ (df2['U']>0) & (df2['X'] > 0.1)]

          U         V         W         X         Y
C  0.343539  0.196275 -0.982776  2.231555 -0.971393

# Groupby

Here you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [ ]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
       'Person':['Erasto','Oluoch','Faith','Noel','Kantei','Gitumbu'],
       'Result':[200, 120, 340,124,243,350]}

df6 = pd.DataFrame(data)

In [ ]:
df6

  Company   Person  Result
0  GOOGLE   Erasto     200
1  GOOGLE   Oluoch     120
2    MSFT    Faith     340
3    MSFT     Noel     124
4      FB   Kantei     243
5      FB  Gitumbu     350

In [ ]:
df6.groupby('Company')
comp_mean = df6.groupby("Company").mean()
comp_mean

         Result
Company
FB        296.5
GOOGLE    160.0
MSFT      232.0

# Merging, Joining and Concatenating

In [ ]:
df_a = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df_a

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df_b = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df_b

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
pd.concat([df_a, df_b])#default axis=0

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
pd.concat([df_a, df_b], axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

#2.Merge

In [ ]:
left_df = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right_df = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
left_df

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [ ]:
right_df

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [ ]:
pd.merge(left_df, right_df, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [ ]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2'])

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [ ]:
# Save dataframe as a csv file

right.to_csv('example_save.csv', index=False)

# Other ways of reading  other versions of datasets with pandas

In [ ]:
# import json file as 

df9 = pd.read_json('/content/sample_data/anscombe.json')

In [ ]:
df9.head()

  Series   X     Y
0      I  10  8.04
1      I   8  6.95
2      I  13  7.58
3      I   9  8.81
4      I  11  8.33

In [ ]:
'''
df9.to_excel('Excel_Sample.xlsx')
df10 = pd.read_html('https://en.wikipedia.org/wiki/Local_government_areas_of_Nigeria')
'''

"\ndf9.to_excel('Excel_Sample.xlsx')\ndf10 = pd.read_html('https://en.wikipedia.org/wiki/Local_government_areas_of_Nigeria')\n"

# Thank You